app/controllers/galleries_controller.rb

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "pictures".* FROM "pictures" WHERE (gallery_id = 1)
---
  def show
    @gallery = Gallery.find(params[:id])
    @picture = @gallery.pictures.build
    @pictures = Picture.find(:all, :conditions  => [ 'gallery_id = ?', @gallery.id ])

SELECT "pictures".* FROM "pictures" WHERE "pictures"."gallery_token" = 'A2bsA28wQjSp_9vLLa5WeQ'
INSERT INTO "galleries" ("cover", "created_at", "description", "name", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "pictures" SET "gallery_id" = 1, "updated_at" = '2013-05-08 07:39:18.820211' WHERE "pictures"."id" = 1
---
  def create
    @gallery = Gallery.new(gallery_params)
    @pictures = Picture.where(:gallery_token => @gallery.token)
    @gallery.pictures << @pictures

    respond_to do |format|
      if @gallery.save

SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "galleries" WHERE "galleries"."id" = ?  [["id", 1]]
---
  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy