app/controllers/pictures_controller.rb

  def create

    p_attr[:image] = params[:picture][:image].first if params[:picture][:image].class == Array

    if params[:gallery_id]
      @gallery = Gallery.find(params[:gallery_id])
      @picture = @gallery.pictures.build(picture_params)
    else
      @picture = Picture.new(p_attr)
    end

    if @picture.save
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "pictures" ("created_at", "description", "gallery_id", "gallery_token", "image", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @gallery = Gallery.find(params[:gallery_id])
    @picture = @gallery.pictures.find(params[:id])
    @picture.destroy
---
SELECT "galleries".* FROM "galleries" WHERE "galleries"."id" = ? LIMIT 1  [["id", "undefined"]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."gallery_id" = 1 AND "pictures"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 1]]